assignments/03/assign03.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-05 Thu 18:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Assignment 3</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../style.css" />
</head>
<body>
<div id="org-div-home-and-up">[<a href="../../index.html">back</a>]</div><div id="content" class="content">
<h1 class="title">Assignment 3</h1>
<p>
The following assignment is due <b>Thursday February 12 by 8:00 PM</b>.
Your solutions should be submitted via Gradescope as a single pdf.
They must be exceptionally neat (or typed) and the final answer in
your solution to each problem must be abundantly clear, e.g.,
surrounded in a box.  Also make sure to cite your sources per the
instructions in the course manual.
</p>

<p>
The problems are taken from the workbook <i>Problems and Exercises</i>
included in the course material based on version: <a href="https://nmmull.github.io/cs132-s26/workbook/v003.pdf"><b>v0.0.3</b></a>
</p>

<p>
These problems are based on problems that come from <i>Linear Algebra
and it's Applications</i> by David C. Lay, Steven R. Lay, and Judi
J. McDonald.  As a reminder, we recommend this textbook as a source
for supplementary exercises.  The relevant sections for this
assignment are: <b>1.4</b>, <b>1.7</b>
</p>

<p>
<b>Basic Problems:</b> 3.3, 3.4, 3.5, 3.6, 3.11, 3.12, 4.2, 4.4, 4.6
</p>

<p>
<b>True/False:</b> 3.16, 3.19, 3.20, 3.23, 4.7, 4.9, 4.12, 4.14, 4.15
</p>

<p>
<b>More Difficult Problems:</b> 3.27, 3.30, 4.16, 4.17, 4.23
</p>

<p>
<b>Challenge Problems (Optional):</b> 3.31, 4.26
</p>
</div>
</body>
</html>
